{
  "characters": [
    {
      "name": "Media",
      "introduction": "As a media person, your role is to capture the truth amidst the chaos of the protest.",
      "currentSituation": "The protest is escalating, and there are conflicting reports about the police's actions.",
      "strengths": "Access to information, neutral perspective",
      "weaknesses": "Limited authority, can be targeted",
      "equipment": "Camera, microphone",
      "choices": [
        {
          "id": 1,
          "text": "Interview protestors to get their side of the story.",
          "outcome": "You gather firsthand accounts, but risk being targeted by the police.",
          "mark": 10
        },
        {
          "id": 2,
          "text": "Focus on documenting the police's actions.",
          "outcome": "You capture important footage but might miss critical information from the protestors.",
          "mark": -5
        }
      ]
    },
    {
      "name": "Rookie Officer",
      "introduction": "You are a new recruit tasked with keeping order during the protest.",
      "currentSituation": "Tensions are rising, and you must make quick decisions to maintain control.",
      "strengths": "Enthusiasm, training in crowd control",
      "weaknesses": "Lack of experience, indecisiveness",
      "equipment": "Tear gas, baton",
      "choices": [
        {
          "id": 1,
          "text": "Try to negotiate with the protestors to de-escalate the situation.",
          "outcome": "The protestors listen to you, but your inexperience shows, and things could still spiral out of control.",
          "mark": 5
        },
        {
          "id": 2,
          "text": "Use tear gas to disperse the crowd.",
          "outcome": "The crowd scatters, but the use of force could escalate tensions.",
          "mark": -10
        }
      ]
    },
    {
      "name": "Veteran Officer",
      "introduction": "As a seasoned officer, you are familiar with controlling large crowds, but the situation today is tense.",
      "currentSituation": "Protestors are growing restless, and your experience tells you that things could go wrong fast.",
      "strengths": "Years of experience, leadership skills",
      "weaknesses": "Physically slower, rigid tactics",
      "equipment": "Riot shield, radio",
      "choices": [
        {
          "id": 1,
          "text": "Order your unit to form a defensive line.",
          "outcome": "The crowd backs off slightly, but the protestors are still agitated.",
          "mark": 7
        },
        {
          "id": 2,
          "text": "Attempt to arrest the protest leaders.",
          "outcome": "You remove key agitators, but this could spark anger among the remaining protestors.",
          "mark": -8
        }
      ]
    },
    {
      "name": "Protestor",
      "introduction": "You are part of a group protesting for change, determined to make your voice heard.",
      "currentSituation": "The police are forming up, and tensions are at a breaking point.",
      "strengths": "Passion, strong beliefs",
      "weaknesses": "Limited protection, vulnerability to law enforcement",
      "equipment": "Placards, banners",
      "choices": [
        {
          "id": 1,
          "text": "Lead a chant to keep the protestors united and peaceful.",
          "outcome": "The crowd follows your lead, but the police are getting restless.",
          "mark": 6
        },
        {
          "id": 2,
          "text": "Encourage protestors to confront the police peacefully.",
          "outcome": "Tensions rise as protestors approach the police lines, risking escalation.",
          "mark": -7
        }
      ]
    },
    {
      "name": "Politician",
      "introduction": "As a politician, you must balance the demands of the protestors with the need to maintain order.",
      "currentSituation": "You’ve arrived at the protest site, and both sides are looking to you for guidance.",
      "strengths": "Influence, negotiation skills",
      "weaknesses": "Public scrutiny, divided loyalties",
      "equipment": "Speeches, bodyguards",
      "choices": [
        {
          "id": 1,
          "text": "Address the crowd to try and calm the situation.",
          "outcome": "Your speech resonates with some, but others remain unsatisfied.",
          "mark": 8
        },
        {
          "id": 2,
          "text": "Privately meet with the protest leaders to discuss their demands.",
          "outcome": "You gain valuable insight but risk appearing indecisive to the public.",
          "mark": -6
        }
      ]
    }
  ]
}
